<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1304bf322987c8fa3606f5ccb05292c036d17ab712dfc3c873d102f1052e0a6d","plan_job_ref":"Job Test actions using target and replace #471 at https://github.com/dflook/terraform-github-actions/actions/runs/14145155863","plan_out_hash":"b4e00fef2d090c81e3a3da00a64704ad5fc7273bdf3ae545bc98b332d5068125","plan_hash":"1bd569e9c7c1125b2557ddf782e5d5b75e8c9e5c5b32bb286b7e95b7d6920510","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "Pb7h0rF2PZ" -> (known after apply)
!~  foreach = "x4RENQtpcL" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #471](https://github.com/dflook/terraform-github-actions/actions/runs/14145155863)